Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/admin-guide/configuration.po
Languages: sr

source: Configuration Reference
sr: Референца конфигурације

source: Complete reference for ``/usr/local/share/tenctl/config/tenant.conf``.
sr: Комплетна референца за ``/etc/tenctl/клијент.conf``.

source: Configuration File Location
sr: Локација конфигурационог фајла

source: The main configuration file is located at::
sr: Главни конфигурациони фајл се налази на::

source: This file contains global settings for the multi-tenant system.
sr: Овај фајл садржи глобална подешавања за више-клијент систем.

source: VLAN Configuration
sr: VLAN конфигурација

source: **Type:** Integer
sr: **Тип:** Integer

source: **Default:** ``100``
sr: **Подразумевано:** ``100``

source: **Description:** Starting VLAN ID for tenant allocation pool.
sr: **Опис:** Почетни VLAN ID за pool за алокацију клијента.

source: **Example:**
sr: **Пример:**

source: **Default:** ``999``
sr: **Подразумевано:** ``999``

source: **Description:** Ending VLAN ID for tenant allocation pool.
sr: **Опис:** Завршни VLAN ID за pool за алокацију клијента.

source: **Valid Range:** VLAN_START to 4094 (maximum VLAN ID)
sr: **Важећи опсег:** VLAN_START до 4094 (максимални VLAN ID)

source: **Note:** Total available VLANs = VLAN_END - VLAN_START + 1
sr: **Напомена:** Укупно доступних VLAN-ова = VLAN_END - VLAN_START + 1

source: Network Configuration
sr: Конфигурација мреже

source: **Type:** String (IP prefix)
sr: **Тип:** String (IP префикс)

source: **Default:** ``"10.100"``
sr: **Подразумевано:** ``"10.100"``

source: **Description:** Base subnet prefix for tenant networks. Each tenant receives a /24 subnet.
sr: **Опис:** Основни префикс подмреже за мреже клијента. Сваки клијент добија /24 подмрежу.

source: This results in subnets like:
sr: Ово резултује подмрежама као:

source: Tenant 1: 10.100.0.0/24
sr: клијент 1 (VLAN 100): 10.100.0.0/24

source: Tenant 2: 10.100.1.0/24
sr: клијент 2 (VLAN 101): 10.100.1.0/24

source: Tenant N: 10.100.N-1.0/24
sr: клијент 2 (VLAN 101): 10.100.1.0/24

source: **Type:** String
sr: **Тип:** String

source: **Default:** ``"vmbr0"``
sr: **Подразумевано:** ``"vmbr0"``

source: **Description:** Default Proxmox network bridge for VLAN configuration.
sr: **Опис:** Подразумевани Proxmox мрежни bridge за VLAN конфигурацију.

source: Storage Configuration
sr: Конфигурација складишта

source: **Type:** String (path)
sr: **Тип:** String (путања)

source: **Default:** ``"/etc/pve/tenants"``
sr: **Подразумевано:** ``"/etc/pve/tenants"``

source: **Description:** Directory for tenant configuration files. Located in pmxcfs for automatic cluster synchronization.
sr: **Опис:** Директоријум за конфигурационе фајлове клијента. Налази се у pmxcfs за аутоматску синхронизацију кластера.

source: **Note:** This directory is automatically synchronized across cluster nodes via pmxcfs.
sr: **Напомена:** Овај директоријум се аутоматски синхронизује преко чворова кластера преко pmxcfs.

source: Resource Defaults
sr: Подразумевани ресурси

source: **Default:** ``8``
sr: **Подразумевано:** ``8``

source: **Description:** Default CPU core limit for new tenants.
sr: **Опис:** Подразумевано ограничење CPU језгара за нове клијенте.

source: **Type:** Integer (MB)
sr: **Тип:** Integer (MB)

source: **Default:** ``16384`` (16 GB)
sr: **Подразумевано:** ``16384`` (16 GB)

source: **Description:** Default RAM limit for new tenants in megabytes.
sr: **Опис:** Подразумевано ограничење RAM-а за нове клијенте у мегабајтима.

source: **Conversion:**
sr: **Конверзија:**

source: **Type:** Integer (GB)
sr: **Тип:** Integer (GB)

source: **Default:** ``500``
sr: **Подразумевано:** ``500``

source: **Description:** Default storage limit for new tenants in gigabytes.
sr: **Опис:** Подразумевано ограничење складишта за нове клијенте у гигабајтима.

source: **Note:** Resource limits are monitored by the ``tenctl-watcher`` systemd service.
sr: **Напомена:** Ограничења ресурса се надгледају преко ``tenctl-watcher`` systemd сервиса.

source: SDN Configuration
sr: SDN конфигурација

source: **Type:** String (enum)
sr: **Тип:** String (enum)

source: **Default:** ``"vxlan"``
sr: **Подразумевано:** ``"vxlan"``

source: **Valid Values:**
sr: **Важеће вредности:**

source: ``"vlan"`` - VLAN zone (single-node or managed switch)
sr: ``"vlan"`` - VLAN зона (један čvor или управљани switch)

source: ``"vxlan"`` - VXLAN zone (multi-node overlay)
sr: ``"vxlan"`` - VXLAN зона (overlay са више чворова)

source: ``"simple"`` - Simple zone (untagged)
sr: ``"simple"`` - Једноставна зона (untagged)

source: **Description:** SDN zone type for Proxmox network virtualization.
sr: **Опис:** SDN тип зоне за Proxmox мрежну виртуализацију.

source: **Recommendations:**
sr: **Препоруке:**

source: Single-node: Use ``"vlan"``
sr: Један čvor: Користите ``"vlan"``

source: Multi-node cluster: Use ``"vxlan"``
sr: Кластер са више чворова: Користите ``"vxlan"``

source: Basic setup: Use ``"simple"``
sr: Основно подешавање: Користите ``"simple"``

source: **Default:** ``"tenants"``
sr: **Подразумевано:** ``"tenants"``

source: **Max Length:** 8 characters (Proxmox API limitation)
sr: **Максимална дужина:** 8 карактера (Proxmox API ограничење)

source: **Description:** Name of the SDN zone.
sr: **Опис:** Име SDN зоне.

source: **Default:** ``4789``
sr: **Подразумевано:** ``4789``

source: **Description:** UDP port for VXLAN encapsulation (only used if SDN_ZONE_TYPE="vxlan").
sr: **Опис:** UDP порт за VXLAN енкапсулацију (користи се само ако је SDN_ZONE_TYPE="vxlan").

source: **Note:** Standard VXLAN port is 4789.
sr: **Напомена:** Стандардни VXLAN порт је 4789.

source: Permissions Configuration
sr: Конфигурација дозвола

source: **Default:** ``"PVEPoolAdmin"``
sr: **Подразумевано:** ``"PVEPoolAdmin"``

source: **Description:** Proxmox role assigned to tenant admin users.
sr: **Опис:** Proxmox улога додељена администраторима клијента.

source: **Available Roles:**
sr: **Доступне улоге:**

source: ``PVEPoolAdmin`` - Pool administrator (recommended)
sr: ``PVEPoolAdmin`` - Pool администратор (препоручено)

source: ``PVEPoolUser`` - Pool user (read-only)
sr: ``PVEPoolUser`` - Pool корисник (само читање)

source: Custom role created in Proxmox
sr: Прилагођена улога креирана у Proxmox-у

source: Logging Configuration
sr: Конфигурација логовања

source: **Default:** ``"/var/log/tenctl"``
sr: **Подразумевано:** ``"/var/log/tenctl"``

source: **Description:** Directory for tenant management logs.
sr: **Опис:** Директоријум за логове управљања клијент-има.

source: **Log Files:**
sr: **Лог фајлови:**

source: ``tenant-management.log`` - All operations and audit events
sr: ``клијент.log`` - Лог општих операција

source: Email Notifications
sr: Email обавештења

source: **Type:** Boolean
sr: **Тип:** Boolean

source: **Default:** ``true``
sr: **Подразумевано:** ``true``

source: **Description:** Enable email notifications for tenant operations.
sr: **Опис:** Омогући email обавештења за операције клијента.

source: **Default:** ``"Gmail"``
sr: **Подразумевано:** ``"Gmail"``

source: **Description:** Name of SMTP endpoint configured in Proxmox ``/etc/pve/notifications.cfg``.
sr: **Опис:** Име SMTP endpoint-а конфигурисаног у Proxmox ``/etc/pve/notifications.cfg``.

source: **Note:** Configure SMTP in Proxmox VE first:
sr: **Напомена:** Прво конфигуришите SMTP у Proxmox VE:

source: Navigate to Datacenter → Notifications
sr: Навигирајте до Datacenter → Notifications

source: Add SMTP endpoint
sr: Додајте SMTP endpoint

source: Use the name here
sr: Користите име овде

source: VyOS Router Configuration
sr: VyOS ruter конфигурација

source: **Description:** Enable VyOS router integration for L3 routing and NAT.
sr: **Опис:** Омогући VyOS ruter интеграцију за L3 рутирање и NAT.

source: **Default:** ``"pve3"``
sr: **Подразумевано:** ``"pve3"``

source: **Description:** Proxmox node name where VyOS VM is running.
sr: **Опис:** Име Proxmox čvora на коме ради VyOS VM.

source: **Default:** ``900``
sr: **Подразумевано:** ``900``

source: **Description:** VM ID of the VyOS router.
sr: **Опис:** VM ID VyOS ruter-а.

source: **Default:** ``"vyos"``
sr: **Подразумевано:** ``"vyos"``

source: **Description:** SSH username for VyOS router.
sr: **Опис:** SSH корисничко име за VyOS ruter.

source: **Note:** Default VyOS username is ``vyos``.
sr: **Напомена:** Подразумевано VyOS корисничко име је ``vyos``.

source: **Type:** String (IP address)
sr: **Тип:** String (IP адреса)

source: **Default:** ``"192.168.1.6"``
sr: **Подразумевано:** ``"192.168.1.6"``

source: **Description:** Management IP address of VyOS router.
sr: **Опис:** WAN IP адреса на VyOS ruter-у.

source: **Default:** ``"eth0"``
sr: **Подразумевано:** ``"eth0"``

source: **Description:** WAN interface on VyOS router.
sr: **Опис:** WAN интерфејс на VyOS ruter-у.

source: **Default:** ``"eth1"``
sr: **Подразумевано:** ``"eth1"``

source: **Description:** LAN interface on VyOS for tenant VLANs.
sr: **Опис:** LAN интерфејс на VyOS-у за клијент VLAN-ове.

source: **Description:** WAN IP address on VyOS router.
sr: **Опис:** WAN IP адреса на VyOS ruter-у.

source: **Default:** ``"192.168.1.1"``
sr: **Подразумевано:** ``"192.168.1.1"``

source: **Description:** WAN gateway for VyOS router.
sr: **Опис:** WAN gateway за VyOS ruter.

source: Configuration Examples
sr: Примери конфигурације

source: Minimal Configuration
sr: Минимална конфигурација

source: Basic setup for single-node Proxmox:
sr: Основно подешавање за Proxmox са једним čvorom:

source: Multi-Node Cluster Configuration
sr: Конфигурација кластера са више чворова

source: Configuration for multi-node cluster with VXLAN:
sr: Конфигурација за кластер са више чворова са VXLAN-ом:

source: Best Practices
sr: Најбоље праксе

source: VLAN Planning
sr: Планирање VLAN-ова

source: Reserve ranges for different purposes (e.g., 100-299 production, 300-499 development)
sr: Резервишите опсеге за различите намене (нпр. 100-299 продукција, 300-499 развој)

source: Don't use VLANs below 10 (often reserved for management)
sr: Не користите VLAN-ове испод 10 (често резервисани за управљање)

source: Document VLAN allocations
sr: Документујте VLAN алокације

source: Resource Planning
sr: Планирање ресурса

source: Set conservative defaults
sr: Поставите конзервативне подразумеване вредности

source: Monitor actual usage to adjust limits
sr: Надгледајтете стварно коришћење да прилагодите ограничења

source: Plan for growth (increase VLAN_END as needed)
sr: Планирајте за раст (повећајте VLAN_END по потреби)

source: Security
sr: Безбедност

source: Restrict access to configuration file::
sr: Ограничите приступ конфигурационом фајлу::

source: Use strong VyOS credentials
sr: Користите јаке VyOS креденцијале

source: Enable email notifications for audit trail
sr: Омогућите email обавештења за ревизијски траг

source: Cluster Configuration
sr: Конфигурација кластера

source: Use VXLAN for multi-node setups
sr: Користите VXLAN за подешавања са више чворова

source: Ensure consistent configuration across nodes
sr: Обезбедите доследну конфигурацију преко чворова

source: Test failover scenarios
sr: Тестирајте failover сценарије

source: Validating Configuration
sr: Валидација конфигурације

source: After modifying configuration, validate:
sr: После измене конфигурације, валидирајте:

source: See Also
sr: Видите такође

source: :doc:`operations` - Operations and maintenance procedures
sr: :doc:`operations` - Процедуре за операције и одржавање

source: :doc:`../getting-started/index` - Getting started guide
sr: :doc:`../getting-started/installation` - Водич за инсталацију
