Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/admin-guide/operations.po
Languages: sr

source: Operations
sr: Операције

source: Cluster setup, security, troubleshooting, performance, and maintenance.
sr: Подешавање кластера, безбедност, решавање проблема, перформансе и одржавање.

source: Cluster Setup
sr: Подешавање кластера

source: Prerequisites
sr: Предуслови

source: All nodes in Proxmox cluster
sr: Сви чворови у Proxmox кластеру

source: SSH access between nodes
sr: SSH приступ између чворова

source: Shared storage (optional but recommended)
sr: Дељено складиште (опционо али препоручено)

source: Installation
sr: Инсталација

source: Automatic cluster-wide installation:
sr: Аутоматска инсталација на целом кластеру:

source: Manual installation per node:
sr: Ручна инсталација по чвору:

source: Configuration Synchronization
sr: Верификација синхронизације:

source: Configuration is automatically synchronized via pmxcfs. All tenant configurations in ``/etc/pve/tenants/`` replicate to all nodes.
sr: Конфигурација се аутоматски синхронизује преко pmxcfs. Све конфигурације клијената у ``/etc/pve/tenctl/`` се реплицирају на све чворове.

source: Verify synchronization:
sr: Верификација синхронизације:

source: All nodes should show identical tenant lists.
sr: Сви чворови би требало да приказују идентичне листе клијената.

source: Security
sr: Безбедност

source: Principle of Least Privilege
sr: Принцип најмањих привилегија

source: Tenant users receive minimal permissions:
sr: Корисници клијента добијају минималне дозволе:

source: Access only to their resource pool
sr: Приступ само њиховом скупу ресурса

source: Cannot modify network configuration
sr: Не могу мењати мрежну конфигурацију

source: Cannot create users
sr: Не могу креирати кориснике

source: Cannot access other tenants
sr: Не могу приступити другим клијентима

source: Best Practices
sr: Најбоље праксе

source: **Regular Audits**
sr: **Редовни аудити**

source: **Credential Rotation**
sr: **Ротација акредитива**

source: Rotate VyOS and API credentials periodically.
sr: Ротирајте VyOS и API акредитиве периодично.

source: **Access Control**
sr: **Контрола приступа**

source: Use Proxmox's built-in 2FA for tenant users.
sr: Користите уграђену 2FA Proxmox-а за кориснике клијента.

source: **Network Isolation**
sr: **Мрежна изолација**

source: Ensure VLANs are properly configured on switches.
sr: Осигурајте да су VLAN-ови правилно конфигурисани на свичевима.

source: Troubleshooting
sr: Решавање проблема

source: Installation Issues
sr: Инсталација

source: **pvesh not found**
sr: **pvesh није пронађен**

source: Ensure you're on a Proxmox VE node.
sr: Уверите се да сте на Proxmox VE чвору.

source: **Permission denied**
sr: **Дозвола одбијена**

source: Run as root or with sudo.
sr: Покрените као root или са sudo.

source: Tenant Creation
sr: Креирање клијента

source: **No available VLANs**
sr: **Нема доступних VLAN-ова**

source: Increase VLAN pool range in ``/usr/local/share/tenctl/config/tenant.conf``.
sr: Повећајте опсег VLAN скупа у конфигурацији.

source: **Failed to create resource pool**
sr: **Скупови ресурса**

source: Use a different tenant name or remove the existing pool.
sr: Користите другачије име клијента или уклоните постојећи скуп.

source: **VMs cannot communicate**
sr: **VM-ови не могу комуницирати**

source: Verify VLAN configuration on physical switches.
sr: Верификујте VLAN конфигурацију на физичким свичевима.

source: **No internet access**
sr: **Нема приступа интернету**

source: Check VyOS NAT rules and routing.
sr: Проверите VyOS NAT правила и рутирање.

source: Cluster Issues
sr: Подешавање кластера

source: **Configuration not syncing**
sr: **Конфигурација се не синхронизује**

source: Verify pmxcfs is running on all nodes.
sr: Верификујте да је pmxcfs покренут на свим чворовима.

source: **Nodes unreachable**
sr: **Чворови недоступни**

source: Check network connectivity and SSH access.
sr: Проверите мрежну повезаност и SSH приступ.

source: Performance
sr: Перформансе

source: Optimization Tips
sr: Савети за оптимизацију

source: **VLAN Allocation**
sr: **VLAN алокација**

source: Use smaller VLAN pools to reduce search time.
sr: Користите мање VLAN скупове да смањите време претраге.

source: **Resource Pools**
sr: **Скупови ресурса**

source: On Proxmox VE 9.0+, quotas are enforced efficiently.
sr: На Proxmox VE 9.0+, квоте се ефикасно примењују.

source: **Monitoring**
sr: **Надгледање**

source: Use ``tenctl-usage`` to identify resource-intensive tenants.
sr: Користите ``tenctl-usage`` да идентификујете клијенте који захтевају много ресурса.

source: Limit VLAN pool size
sr: Ограничите величину VLAN скупа

source: Regular cleanup of unused tenants
sr: Редовно чишћење неискоришћених клијената

source: Maintenance
sr: Одржавање

source: System Updates
sr: Ажурирање система

source: Update Tenctl:
sr: Ажурирање Tenctl:

source: Configuration Backups
sr: Резервне копије конфигурације

source: Backup all tenant configurations:
sr: Правите резервне копије свих конфигурација клијената:

source: Weekly configuration backups
sr: Недељне резервне копије конфигурације

source: Monthly system updates
sr: Месечна ажурирања система

source: Quarterly audit reviews
sr: Квартални прегледи аудита
