Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/user-guide/advanced-topics/backup-restore.po
Languages: sr

source: Backup and Restore
sr: Резервна копија and Враћа

source: Backup Operations
sr: Резервна копија Operations

source: Export tenant configuration:
sr: Извезите конфигурацију клијента:

source: This exports:
sr: Ово извози:

source: Tenant metadata
sr: Клијент metadata

source: Resource limits
sr: Ресурс limits

source: VLAN and subnet configuration
sr: VLAN и конфигурацију подмреже

source: User and group information
sr: Поставке корисничке групе

source: Restore Operations
sr: Враћа Operations

source: Restore tenant from backup:
sr: Враћа tenant from backup:

source: Best Practices
sr: Најбоље праксе

source: **Regular Backups**
sr: **Regular резервне копије**

source: Backup configs before major changes.
sr: Резервна копија configs before major changes.

source: **Version Control**
sr: **Верзија Control**

source: **Test Restores**
sr: **Test Враћаs**

source: Periodically test restore process.
sr: Периодично тестирајте процес рестора.
