Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/user-guide/advanced-topics/networking.po
Languages: sr

source: Networking
sr: Умрежавање

source: VLANs are automatically allocated from a configured pool.
sr: VLAN-ови се аутоматски алоцирају из конфигурисаног пула.

source: Configuration
sr: Конфигурација

source: Set VLAN pool in ``/usr/local/share/tenctl/config/tenant.conf``:
sr: Подесите VLAN пул у ``/etc/tenctl/tenant.conf``:

source: This allows 101 tenants (VLAN 100-200 inclusive).
sr: Ово дозвољава 101 клијента (VLAN 100-200 инклузивно).

source: Automatic Allocation
sr: Аутоматска алокација

source: By default, first available VLAN is assigned:
sr: Подразумевано, први доступни VLAN је додељен:

source: Manual Assignment
sr: Ручна додела

source: Specify VLAN during creation:
sr: Наведите VLAN током креирања:

source: Subnet Assignment
sr: Подмрежа Assignment

source: Subnets are automatically allocated from the configured base range.
sr: VLAN-ови се аутоматски алоцирају из конфигурисаног пула.

source: Formula
sr: Формула

source: Examples:
sr: Примери:

source: Manual Subnet
sr: Manual Подмрежа

source: Setup
sr: Поставка

source: This configures:
sr: Ово конфигурише:

source: VLAN interface on VyOS
sr: VLAN интерфејс на VyOS

source: Gateway IP address
sr: Gateway IP адреса

source: NAT rules for internet access
sr: NAT правила за интернет приступ
