Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/user-guide/tenant-management/lifecycle.po
Languages: sr

source: Tenant Lifecycle
sr: Животни циклус клијента

source: Creating Tenants
sr: Креирање Клијенти

source: Use ``tenctl-add`` to create new tenants:
sr: Користите ``tenctl-add`` за креирање нових клијената:

source: Required Parameters
sr: Обавезно Параметри

source: ``-n, --name`` - Tenant name (must start with a letter, alphanumeric/underscore only)
sr: ``-n, --name`` - Име клијента (почиње словом, само алфанумерички/доња црта)

source: Optional Parameters
sr: Опционо Параметри

source: ``-s, --storage`` - Storage in GB (default from config)
sr: ``-s, --storage`` - Складиште in GB

source: What Gets Created
sr: What Gets Креираd

source: The system automatically creates:
sr: Систем аутоматски креира:

source: VLAN allocation (first available from configured range)
sr: VLAN алокацију (прву доступну из пула)

source: Configuration in pmxcfs (``/etc/pve/tenants``)
sr: Конфигурација in pmxcfs

source: Modifying Tenants
sr: Измена Клијенти

source: Update tenant resources:
sr: Ажурирајте ресурсе клијента:

source: You can modify:
sr: Можете изменити:

source: Storage in GB (``-s``)
sr: Складиште in GB (``-s``)

source: **Note:** Resource modifications apply to pool limits. Running VMs are not automatically adjusted.
sr: **Напомена:** Ресурс modifications apply to pool limits. Running VMs are not automatically adjusted.

source: Suspending Tenants
sr: Суспендовање Клијенти

source: Temporarily disable a tenant:
sr: Привремено онемогућите клијента:

source: This will:
sr: Ово ће:

source: Mark tenant as suspended in configuration
sr: Означи клијента као суспендованог у конфигурацији

source: Non-payment
sr: Неплаћање

source: Security incident
sr: Безбедносни инцидент

source: Maintenance window
sr: Прозор одржавања

source: Contract suspension
sr: Суспензија уговора

source: Resuming Tenants
sr: Настављање Клијенти

source: Reactivate a suspended tenant:
sr: Реактивирајте суспендованог клијента:

source: Mark tenant as active
sr: Mark tenant as активан

source: Removing Tenants
sr: Уклањање Клијенти

source: Permanently remove a tenant:
sr: Трајно уклоните клијента:

source: **WARNING:** This is a destructive operation. The system will prompt for confirmation.
sr: **УПОЗОРЕЊЕ:** Ово је деструктивна операција. Систем ће тражити потврду.

source: What Gets Removed
sr: What Gets Уклониd

source: User, user group, and ACLs
sr: Корисничку групу и дозволе

source: Resource pool
sr: Ресурс pool

source: Tenant configuration
sr: Клијент configuration

source: What Is Preserved
sr: Шта се чува
