Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/user-guide/tenant-management/monitoring.po
Languages: sr

source: Monitoring and Auditing
sr: Надгледање and Аудитing

source: Health Checks
sr: Здравље Checks

source: Verify tenant configuration:
sr: Верификујте конфигурацију клијента:

source: Checks performed:
sr: Извршене провере:

source: ✓ SDN zone configuration
sr: ✓ Умрежавање configuration valid

source: ✓ Tenant configuration integrity
sr: Верификујте конфигурацију клијента:

source: Verbose output:
sr: Опширан излаз:

source: Audit Logs
sr: Аудит Logs

source: View tenant audit trail:
sr: Погледајте аудит траг клијента:

source: Logs all operations:
sr: Логује све операције:

source: Tenant creation
sr: Клијент creation

source: Modifications
sr: Модификације

source: Suspensions/resumes
sr: Суспензије/настављања

source: Removals
sr: Уклањања

source: System-wide audit:
sr: Системски аудит:

source: JSON output:
sr: Опширан излаз:

source: Best Practices
sr: Најбоље праксе

source: **Start Conservative**
sr: **Почните конзервативно**

source: Begin with lower limits and increase as needed with ``tenctl-modify``.
sr: Почните са нижим лимитима и повећајте по потреби са ``tenctl-modify``.

source: **Monitor Regularly**
sr: **Надгледајте Regularly**

source: Use ``tenctl-usage`` to track consumption and identify growth trends.
sr: Користите ``tenctl-usage`` за праћење потрошње и идентификацију трендова раста.

source: **Review Health**
sr: **Review Здравље**

source: Run ``tenctl-health`` regularly to ensure configuration integrity.
sr: Покрећите ``tenctl-health`` редовно да осигурате интегритет конфигурације.

source: **Check Audit Logs**
sr: **Check Аудит Logs**

source: Review ``tenctl-audit`` for compliance and troubleshooting.
sr: Прегледајте ``tenctl-audit`` за усклађеност и решавање проблема.

source: **Suspend Instead of Remove**
sr: **Суспендуј Instead of Уклони**

source: Use ``tenctl-suspend`` for temporary issues instead of removing tenants.
sr: Користите ``tenctl-suspend`` за привремене проблеме уместо уклањања клијената.
