Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/user-guide/tenant-management/resources.po
Languages: sr

source: Resource Management
sr: Ресурс Watcher

source: Resource Pools
sr: Скупови ресурса

source: Each tenant gets a dedicated Proxmox resource pool with defined limits for CPU, RAM, and storage.
sr: Сваки клијент добија посвећен Proxmox скуп ресурса са дефинисаним лимитима за CPU, RAM и складиште.

source: During creation:
sr: Током креирања:

source: After creation:
sr: После креирања:

source: Monitoring Usage
sr: Надгледање Коришћење

source: Check resource usage:
sr: Проверите коришћење ресурса:

source: Output shows:
sr: Излаз shows:

source: Resource Watcher
sr: Ресурс Watcher

source: The ``tenctl-watcher`` systemd service continuously monitors tenant resource usage.
sr: ``tenctl-watcher`` systemd сервис континуирано надгледа коришћење ресурса клијента.

source: Check service status:
sr: Провери статус сервиса:

source: View logs:
sr: Погледај логове:
