Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/reference/error-codes.po
Languages: sr

source: Error Codes
sr: Кодови грешака

source: Exit codes and error messages.
sr: Излазни кодови и поруке о грешкама.

source: Exit Codes
sr: Излазни кодови

source: Code
sr: Код

source: Description
sr: Опис

source: Success
sr: Успех

source: General error (most failures)
sr: Општа грешка

source: Error Messages
sr: Поруке о грешкама

source: Common error messages and solutions:
sr: Уобичајене поруке о грешкама и решења:

source: **ERROR: Tenant 'NAME' already exists**
sr: **ERROR: клијент already exists**

source: A tenant with this name already exists. Use a different name or remove the existing tenant.
sr: клијент са овим именом већ постоји. Користите другачије име или уклоните постојећи клијент.

source: **ERROR: No available VLAN IDs in range X-Y**
sr: **ERROR: No available VLANs**

source: VLAN pool exhausted. Increase VLAN range or remove unused tenants.
sr: VLAN pool исцрпљен. Повећајте опсег pool-а или уклоните некоришћене клијенте.

source: Proxmox API error. Check Proxmox logs and permissions.
sr: Proxmox API грешка. Проверите Proxmox логове и дозволе.

source: **ERROR: This script must be run as root**
sr: Команда мора бити покренута као root.

source: Command must be run as root.
sr: Команда мора бити покренута као root.

source: See :doc:`../admin-guide/operations` for more details.
sr: Погледајте :doc:`../admin-guide/troubleshooting` за више детаља.
