Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: sr

source: Documentation
sr: Документација

source: Tenctl - Multi-Tenant Management for Proxmox VE
sr: Tenctl - Управљање више-клијент окружењима за Proxmox VE

source: **Version:** 1.0.2
sr: **Верзија:** 1.0.2

source: A pure Bash CLI tool for managing multi-tenant environments on Proxmox VE clusters. This system provides complete tenant isolation through resource pools, VLANs, user groups, and VyOS integration.
sr: Алат написан искључиво у Bash-у за управљање више-клијентским окружењима на Proxmox VE кластерима. Систем обезбеђује потпуну изолацију клијента кроз resource pools, VLAN-ове, корисничке групе и VyOS интеграцију.

source: 🚀 Getting Started
sr: 🚀 Почетак рада

source: Installation, quickstart guide, and basic concepts for new users.
sr: Инсталација, брзи водич и основни концепти за нове кориснике.

source: 📘 User Guide
sr: 📘 Кориснички водич

source: Complete guide to tenant lifecycle, networking, and resource management.
sr: Комплетан водич за животни циклус клијента (tenant-а), умрежавање и управљање ресурсима.

source: 🔧 Admin Guide
sr: 🔧 Администраторски водич

source: Cluster setup, configuration reference, security, and troubleshooting.
sr: Подешавање кластера, референца конфигурације, безбедност и решавање проблема.

source: 📚 Reference
sr: 📚 Референца

source: CLI command reference and error codes.
sr: CLI команде, функције модула, конфигурација и кодови грешака.

source: Key Features
sr: Кључне карактеристике

source: **Complete Tenant Isolation**: Resource pools, VLANs, user groups, and permissions
sr: **Потпуна изолација клијента (tenant-а)**: Resource pools, VLAN-ови, корисничке групе и дозволе

source: **Network Integration**: Automatic VLAN allocation with VyOS router support
sr: **Мрежна интеграција**: Аутоматска алокација VLAN-ова са подршком за VyOS рутер

source: **Resource Management**: CPU, RAM, and storage monitoring via systemd service
sr: **Управљање ресурсима**: Праћење CPU, RAM и storage-а преко systemd сервиса

source: **Cluster-Aware**: Multi-node synchronization via pmxcfs
sr: **Подршка за кластер**: Синхронизација више чворова преко pmxcfsа

source: **Modular Design**: Git-style architecture with 18 library modules
sr: **Модуларни дизајн**: Git-стил архитектура са 18 библиотечких модула

source: **Pure Bash**: No external dependencies beyond Proxmox VE APIs
sr: **Искључиво Bash**: Без спољних зависности осим Proxmox VE API-ја

source: **Audit Trail**: Complete tenant lifecycle logging
sr: **Ревизиони траг**: Комплетно логовање животног циклуса клијента (tenant-а)

source: Quick Start
sr: Брзи почетак

source: Install using the bootstrap script:
sr: Инсталација користећи bootstrap скрипту:

source: Create your first tenant:
sr: Креирате свог првог клијента (tenant):

source: See the :doc:`getting-started/index` guide for detailed walkthrough.
sr: Погледајте :doc:`getting-started/quickstart` водич за детаљан опис.

source: CLI Commands
sr: CLI команде

source: The system provides 14 commands for tenant management:
sr: Систем обезбеђује 14 команди за управљање клијентима (tenant-има):

source: Command
sr: Команда

source: Description
sr: Опис

source: Main entry point and help system
sr: Главна улазна тачка и систем помоћи

source: Initialize the system configuration
sr: Иницијализација конфигурације система

source: Create a new tenant
sr: Креирање новог клијента (tenant)

source: Modify tenant configuration
sr: Измена конфигурације клијента (tenant)

source: Suspend a tenant (pause VMs, revoke permissions)
sr: Суспендовање клијента (tenant) (паузирање VM-ова, одузимање дозвола)

source: Resume a suspended tenant
sr: Настављање рада суспендованог клијента (tenant)

source: Remove a tenant completely
sr: Комплетно уклањање клијента (tenant)

source: List all tenants
sr: Листа свих клијената (tenant-а)

source: Check tenant health status
sr: Провера стања клијента (tenant-а)

source: Display resource usage statistics
sr: Приказ статистике коришћења ресурса

source: Show audit log for tenants
sr: Приказ ревизионог лога за клијенте (tenant)

source: Backup tenant configuration
sr: Резервна копија конфигурације клијента (tenant)

source: Restore tenant from backup
sr: Враћање клијента (tenant) из резервне копије

source: Configure VyOS router integration
sr: Конфигурација VyOS рутер интеграције

source: System Requirements
sr: Системски захтеви

source: Proxmox VE 9.0 or later
sr: Proxmox VE 9.0 или новији

source: Root access on Proxmox nodes
sr: Root приступ на Proxmox чворовима

source: VyOS router (optional, for network isolation)
sr: VyOS рутер (опционо, за мрежну изолацију)

source: Table of Contents
sr: Садржај

source: Indices and Tables
sr: Индекси и табеле

source: License
sr: Лиценца

source: This project is licensed under the MIT License. See :doc:`appendix/license` for full license text.
sr: Овај пројекат је лиценциран под MIT лиценцом. Погледајте :doc:`appendix/license` за детаље.

source: Author
sr: Аутор

source: **Aleksa Savić**
sr: **Алекса Савић**

source: Project Repository: http://192.168.1.201:3000/Aleksa/tenctl
sr: Пројектни репозиторијум: http://192.168.1.201:3000/Aleksa/tenctl

source: Documentation: Built with Sphinx and ReadTheDocs
sr: Документација: Креирана са Sphinx и ReadTheDocs
