Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/user-guide/index.po
Languages: sr

source: User Guide
sr: Кориснички водич

source: Complete guide to using Tenctl for tenant management.
sr: Комплетан водич за коришћење Tenctl - Више-клијент управљање за Proxmox VE.

source: Command Structure
sr: Команда Structure

source: Global Options
sr: Глобалне опције

source: ``tenctl --version``
sr: ``--version``

source: Show version information for the main entrypoint
sr: Прикажи информације о верзији

source: ``--verbose``
sr: ``-v, --verbose``

source: Exit Codes
sr: Кодови за излаз

source: ``0`` - Success
sr: ``0`` - Успех

source: ``1`` - General error (most failures)
sr: ``1`` - Општа грешка
