Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/getting-started/architecture.po
Languages: sr

source: System Architecture
sr: Архитектура система

source: Tenant Isolation Model
sr: Модел изолације клијента

source: Multiple layers ensure complete isolation:
sr: Више слојева осигурава изолацију између клијента:

source: **Layer 1: Resource Pools**
sr: **Слој 1: Resource pool**

source: Proxmox resource pools providing isolation and grouping of tenants
sr: Proxmox resource pool обезбеђује изолацију и груписање клијената

source: **Layer 2: Network VLANs**
sr: **Слој 2: Мрежни VLAN-ови**

source: Dedicated VLAN per tenant for network isolation
sr: Сваки клијент добија одвојен VLAN за мрежну изолацију

source: **Layer 3: User Groups**
sr: **Слој 3: Корисничке групе**

source: Tenant-specific groups with restricted permissions
sr: Групе корисника по клијенту са ограниченим дозволама

source: **Layer 4: ACLs**
sr: **Слој 4: Дозволе (ACL-ови)**

source: Fine-grained access control per tenant
sr: Детаљна контрола приступа осигурава да корисници могу приступити само њиховим клијент ресурсима

source: Command Structure
sr: Структура команди

source: Git-style subcommands::
sr: Подкоманде у Git стилу::

source: Library Modules
sr: Модули библиотеке

source: 18 modules organized by function:
sr: 18 модула организованих по функцији:

source: **Core** (``lib/core/``) - Configuration, logging, validation
sr: **Централно** (``lib/core/``) - Конфигурација, логовање, валидација

source: **Proxmox** (``lib/proxmox/``) - API, pools, users, network
sr: **Proxmox модули** (``lib/proxmox/``) - API, Скупови ресурса, Корисници, Мрежа

source: **Tenant** (``lib/tenant/``) - Lifecycle operations
sr: **клијент модули** (``lib/клијент/``) - Операције животног циклуса

source: **Cluster** (``lib/cluster/``) - Multi-node sync
sr: **Cluster модули** (``lib/cluster/``) - Вишечворна синхронизација

source: **Utils** (``lib/utils/``) - Helpers
sr: **Utility модули** (``lib/utils/``) - Поноћне методе

source: **VyOS** (``lib/vyos/``) - Router integration
sr: **VyOS модули** (``lib/vyos/``) - Интеграција рутера

source: Troubleshooting
sr: Решавање проблема

source: Installation Issues
sr: Проблеми током инсталације

source: **Problem: pvesh not found**
sr: **Проблем: pvesh није пронађен**

source: **Solution:** Install on Proxmox VE node. ``pvesh`` is part of PVE.
sr: **Решење:** Инсталирајте на Proxmox VE чвору. ``pvesh`` је део PVE.

source: **Problem: Permission denied**
sr: **Проблем: Дозвола одбијена**

source: **Solution:** Run with ``sudo`` or as root.
sr: **Решење:** Покрените са ``sudo`` или као root.

source: **Problem: Cluster nodes unreachable**
sr: **Проблем: Чворови кластера недоступни**

source: **Solution:**
sr: **Решење:**

source: Check network connectivity
sr: Проверите мрежну конекцију

source: Verify SSH access: ``ssh node2``
sr: Верификујте SSH приступ: ``ssh node2``

source: Use ``--local-only`` to skip cluster sync
sr: Користите ``--local-only`` да прескочите синхронизацију кластера

source: Tenant Creation Issues
sr: Ток креирања клијента

source: **Problem: VLAN allocation failed**
sr: **Проблем: VLAN алокација неуспела**

source: **Solution:** Increase VLAN pool in ``/usr/local/share/tenctl/config/tenant.conf``.
sr: **Решење:** Повећајте VLAN pool у ``/usr/local/share/tenctl/config/tenant.conf``.

source: **Problem: Pool already exists**
sr: **Проблем: Pool већ постоји**

source: **Solution:** Choose different tenant name or remove existing pool.
sr: **Решење:** Изаберите другачије име клијента или уклоните постојећи pool.
