Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/getting-started/index.po
Languages: sr

source: Getting Started
sr: Почетак

source: Welcome to Tenctl - Multi-Tenant Management for Proxmox VE. This guide will help you install the system and create your first tenant.
sr: Добродошли у Tenctl - Алат за више-клијентско управљање Proxmox VE окружења! Ова секција ће вам помоћи да се брзо упознате са алатаом.

source: What is Tenctl?
sr: Шта је Tenctl?

source: Tenctl is a Bash CLI tool that automates multi-tenant management in Proxmox VE environments. It provides complete tenant isolation through automated creation of resource pools, VLANs, user groups, and permissions.
sr: Tenctl је Bash CLI алат који аутоматизује више-клијентско управљање у Proxmox VE окружењима. Пружа потпуну изолацију клијената кроз аутоматско креирање скупова ресурса, VLAN-ова, корисничких група и дозвола.

source: **Key Features:**
sr: **Кључне карактеристике:**

source: **Automated Tenant Creation** - Single command creates all necessary components
sr: **Аутоматизовано креирање клијената** - Једна команда креира све потребне компоненте

source: **Network Isolation** - Dedicated VLANs and subnets per tenant
sr: **Мрежна изолација** - Одвојени VLAN-ови и подмреже по клијенту

source: **Resource Control** - CPU, RAM, and storage quotas (PVE 9.0+)
sr: **Скупови ресурса** за CPU, RAM и квоте складишта

source: **Cluster-Aware** - Automatic synchronization across cluster nodes
sr: **Свестан кластера** - Аутоматска синхронизација кроз чворове кластера

source: **VyOS Integration** - Optional router integration for L3 routing
sr: **VyOS интеграција** - Опциона интеграција рутера за L3 рутирање

source: **Use Cases:**
sr: **Случајеви употребе:**

source: Service providers hosting multiple customers
sr: Провајдери услуга који хостују више купаца

source: Corporate IT managing department resources
sr: Корпоративни IT који управља ресурсима одељења

source: Educational labs with isolated environments
sr: Едукативне лабораторије са изолованим окружењима

source: Documentation Structure
sr: Структура документације

source: Next Steps
sr: Следећи кораци

source: Once you've completed the quickstart:
sr: Завршите :doc:`quickstart` туторијал

source: :doc:`../user-guide/index` - Complete usage guide
sr: Истражите :doc:`../user-guide/index` за детаљна упутства за коришћење

source: :doc:`../admin-guide/configuration` - Advanced configuration
sr: :doc:`../admin-guide/configuration` - Напредна конфигурација

source: :doc:`../reference/cli-reference` - Command reference
sr: :doc:`../reference/cli-reference` - Референца команди
