Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/getting-started/installation.po
Languages: sr

source: Installation
sr: Инсталација

source: Prerequisites
sr: Предуслови

source: Before installing, ensure you have:
sr: Пре инсталације, уверите се да имате:

source: **System Requirements:**
sr: **Системски захтеви**

source: Proxmox VE 9.0 or later
sr: Proxmox VE 9.0 или новији

source: Root access
sr: Root приступ

source: **Network Requirements:**
sr: **Мрежни захтеви**

source: VLAN support on network infrastructure
sr: VLAN подршка на мрежној инфраструктури

source: VyOS router (optional, for advanced networking)
sr: VyOS ruter (опционо, за напредно умрежавање)

source: Method 1: Bootstrap Install (Recommended)
sr: Метод 1: Bootstrap инсталација (препоручено)

source: One-liner installation from Git repository:
sr: **Bootstrap инсталација** (препоручено) - Инсталација једном линијом из Git репозиторијума

source: This script will:
sr: Ова скрипта ће:

source: Download latest version from Git
sr: Преузети најновију верзију са Gitа

source: Install CLI entrypoints to ``/usr/local/bin/``
sr: Инсталирати у ``/usr/local/bin/``

source: Copy core files to ``/usr/local/share/tenctl/``
sr: Копирати библиотеке у ``/usr/local/lib/tenctl/``

source: Install default configuration to ``/usr/local/share/tenctl/config/tenant.conf``
sr: Инсталирати подразумевану конфигурацију у ``/usr/local/share/tenctl/config/tenant.conf``

source: Offer cluster sync (prompted unless ``-y`` is used)
sr: Понудити синхронизацију кластера (уз потврду, осим ако се користи ``-y``)

source: **Options:**
sr: **Опције**

source: Method 2: Manual Installation
sr: Метод 2: Мануелна инсталација

source: For more control:
sr: За више контроле:

source: **Step 1: Clone the Repository**
sr: **Корак 1: Клонирајте репозиторијум**

source: **Step 2: Run the Installer**
sr: **Корак 2: Покрените install.sh**

source: **Step 3: Verify Installation**
sr: **Корак 3: Верификујте инсталацију**

source: Method 3: Cluster Installation
sr: Метод 3: Кластер инсталација

source: To deploy across all cluster nodes:
sr: **Кластер инсталација** - Аутоматска имплементација на свим кластер чворовима

source: **Step 1: Install on First Node**
sr: **Корак 1: Инсталирајте на првом чвору**

source: **Step 2: Automatic Cluster Sync**
sr: **Корак 2: Синхронизација кластера (аутоматска)**

source: The installer detects cluster membership and installs on all nodes automatically:
sr: Подразумевано, инсталатер детектује чланство кластера и инсталира на свим нодовима. Видећете излаз као:

source: **Step 3: Verify on Each Node**
sr: **Корак 3: Верификујте инсталацију**

source: Post-Installation Setup
sr: Подешавање после инсталације

source: Initialize Configuration
sr: Инициализација конфигурације

source: After installation, run the initialization wizard:
sr: После инсталације, иницијализујте конфигурацију система:

source: This initializes SDN zones and cluster networking using settings from the config file. It uses:
sr: Ово иницијализује SDN зоне и кластерско умрежавање користећи подешавања из конфигурационог фајла. Користи:

source: VLAN pool range (e.g., 100-200)
sr: VLAN опсег pool-а (нпр., 100-200)

source: Subnet allocation (e.g., 10.100.0.0/16 derived from ``BASE_SUBNET``)
sr: Доделу подмреже (нпр., 10.100.0.0/16)

source: Default resource limits for tenants
sr: Storage pool-е за клијент VM-ове

source: VyOS router integration (optional)
sr: VyOS ruter интеграцију (опционо)

source: Network SDN zone type
sr: Тип мрежне SDN зоне

source: Review the configuration:
sr: **Корак 2: Прегледајте конфигурацију**

source: You should see:
sr: Требало би да видите:
