Repository: Aeterno8/tenctl
Catalog: docs/locale/*/LC_MESSAGES/getting-started/quickstart.po
Languages: sr

source: Quick Start Guide
sr: Водич за брзи почетак

source: Step 1: Verify Installation
sr: Корак 1: Верификујте инсталацију

source: Expected output:
sr: Очекивани излаз:

source: Step 2: Create Your First Tenant
sr: Корак 2: Креирате свог првог клијента

source: Create a tenant named "companyA":
sr: Креирате клијента са именом "companyA":

source: **Command Breakdown:**
sr: **Разлагање команде:**

source: ``-n "companyA"`` - Tenant name
sr: ``-n "companyA"`` - Име клијента

source: ``-c 8`` - 8 CPU cores
sr: ``-c 8`` - 8 CPU језгара

source: ``-r 16384`` - 16 GB RAM (in MB)
sr: ``-r 16384`` - 16 GB RAM (у MB)

source: ``-s 500`` - 500 GB storage
sr: ``-s 500`` - 500 GB складишта

source: ``-e`` - Contact email
sr: ``-e`` - Контакт email

source: **What Happens:**
sr: **Шта се дешава:**

source: The system automatically:
sr: Систем аутоматски:

source: Creates resource pool: ``tenant_companyA``
sr: Креира скуп ресурса: ``tenant-companyA``

source: Allocates VLAN from the configured range (first available)
sr: Алоцира VLAN: ``100`` (први доступан)

source: Creates user group: ``group_companyA``
sr: Креира корисничку групу: ``tenant-companyA``

source: Stores configuration in pmxcfs (``/etc/pve/tenants``)
sr: Чува конфигурацију у pmxcfs

source: Step 3: Verify Tenant
sr: Корак 3: Верификујте клијента

source: List tenants:
sr: Прикажите све клијенте:

source: Output:
sr: Излаз:

source: Check resource usage:
sr: Или проверите коришћење ресурса:

source: Step 4: Verify in Proxmox UI
sr: Корак 4: Верификујте у Proxmox Web UI

source: Open Proxmox web interface:
sr: Отворите Proxmox web интерфејс и верификујте:

source: **Datacenter** → **Permissions** → **Pools** - See ``tenant_companyA``
sr: Идите на **Datacenter** → **Permissions** → **Pools**

source: **Datacenter** → **Permissions** → **Groups** - See ``group_companyA``
sr: Идите на **Datacenter** → **Permissions** → **Groups**

source: **Datacenter** → **Permissions** - See ACLs for ``admin_companyA@pve``
sr: Требало би да видите дозволе за ``@клијент-companyA``

source: Common Operations
sr: Уобичајене операције

source: Modify Tenant Resources
sr: Измените ресурсе клијента

source: Increase CPU and RAM:
sr: Повећајте CPU и RAM за клијент:

source: Suspend Tenant
sr: Суспендујте клијент

source: Temporarily disable access:
sr: Привремено онемогућите приступ клијенту:

source: Resume Tenant
sr: Настави клијента

source: Reactivate:
sr: Поново активирајте:

source: Monitor Health
sr: Надгледајте Здравље

source: Check tenant components:
sr: Проверите компоненте клијента

source: Backup Configuration
sr: **Резервна копија конфигурације**

source: Export tenant config:
sr: Извезите конфигурацију клијента:

source: View Audit Log
sr: Погледајте ревизорски лог

source: See operation history:
sr: Погледајте историју операција:

source: Remove Tenant
sr: Уклоните клијент

source: **WARNING:** Permanently removes tenant.
sr: **УПОЗОРЕЊЕ:** Ово трајно уклања клијент. Уверите се да прво направите резервну копију VM-ова.

source: Confirm by typing tenant name:
sr: Потврдите уносом имена клијента:

source: Best Practices
sr: Најбоље праксе

source: **Naming Conventions**
sr: **Конвенције именовања**

source: Use lowercase with hyphens: ``company-name``, ``project-name``
sr: Користите описна имена малим словима са цртицама: ``company-name``, ``project-name``

source: **Resource Planning**
sr: **Планирање ресурса**

source: Start conservative. Easy to increase with ``tenctl-modify``.
sr: Алоцирајте ресурсе конзервативно почетно. Лако је повећати касније са ``tenctl-modify``.

source: **Regular Monitoring**
sr: **Редовно надгледање**

source: Use ``tenctl-usage`` and ``tenctl-health`` regularly.
sr: Користите ``tenctl-usage`` и ``tenctl-health`` редовно.

source: **Backup Configuration**
sr: **Резервна копија конфигурације**

source: Periodically backup: ``tenctl-backup -n <name>``
sr: Периодично правите резервну копију клијент конфигурација: ``tenctl-rezervna kopija <name> > backup.json``

source: **Audit Trail**
sr: **Ревизорска путања**

source: Review logs: ``tenctl-audit``
sr: Прегледајте ревизорске логове за усаглашеност: ``tenctl-audit``
